Revit 2026 API

# IExportContextOnMaterial Method

---

This method marks a change of the material.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
void OnMaterial(
	MaterialNode node
)
```
```vb
Sub OnMaterial (
	node As MaterialNode
)
```
```cpp
void OnMaterial(
	MaterialNode^ node
)
```
```fsharp
abstract OnMaterial :
        node : MaterialNode -> unit
```

#### Parameters

node MaterialNode
     A node describing the current material.

#### Reference

IExportContext Interface

Autodesk.Revit.DB Namespace